Pandas is a Powerful data manipulation library in python , widely used in data analytics and cleaning

In [2]:
import pandas as pd

In [4]:
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series\n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Cerate a series from dictionary
data={'a':1,'b':2,'c':3}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Dataframe - Multiple rows and columns
## create a dataframe from a dictionary of list
data={
    'name':['krish','john','jack'],
    'age':[20,30,40],
    'city':['bangalore','new york','florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age       city
0  krish   20  bangalore
1   john   30   new york
2   jack   40    florida
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['krish', 20, 'bangalore'],
       ['john', 30, 'new york'],
       ['jack', 40, 'florida']], dtype=object)

In [9]:
## create a dataframe from a list of dictionaries
data=[
    {'name':'krish','age':32,'city':'bangalore'},
    {'name':'arya','age':21,'city':'new york'},
    {'name':'ayan','age':20,'city':'kolkata'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata
<class 'pandas.core.frame.DataFrame'>

In [12]:
df=pd.read_csv('sales.csv')
df.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [13]:
df.tail(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [16]:
## accessing data from dataframe
df=pd.DataFrame(data)
df

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata

In [17]:
df['name']

0    krish
1     arya
2     ayan
Name: name, dtype: object

In [18]:
df.loc[0]

name        krish
age            32
city    bangalore
Name: 0, dtype: object

In [22]:
df.iloc[0]

name        krish
age            32
city    bangalore
Name: 0, dtype: object

In [27]:
df

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata

In [30]:
## accessing a specified element
df.at[2,'name']

'ayan'

In [31]:
df

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata

In [32]:
## accessing a specified element using iat
df.iat[2,2]

'kolkata'

In [33]:
df

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata

In [36]:
### data manipulation with dataframe
## adding a column
df['salary']=[5000,10000,15000]
df

    name  age       city  salary
0  krish   32  bangalore    5000
1   arya   21   new york   10000
2   ayan   20    kolkata   15000

In [41]:
## remove a column
df.drop('salary',axis=1,inplace=True) # it  is not a permanant operation
## to make it permanent we have to use another parameter called inplace=true

In [42]:
df

    name  age       city
0  krish   32  bangalore
1   arya   21   new york
2   ayan   20    kolkata

In [45]:
## add age to the column
df['age']=df['age']+1
df

    name  age       city
0  krish   34  bangalore
1   arya   23   new york
2   ayan   22    kolkata

In [47]:
df.drop(0) ## it is not also permanent , to make it permanent, we have to give inplace=True

   name  age      city
1  arya   23  new york
2  ayan   22   kolkata

In [49]:
df=pd.read_csv('sales.csv')
df.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [52]:
## display the data types of each column
print("Data types:\n",df.dtypes)
## describe the dataframe
print("Statistical summary:\n",df.describe())

Data types:
 Sales Person     object
Country          object
Product          object
Date             object
Amount           object
Boxes Shipped     int64
dtype: object
Statistical summary:
        Boxes Shipped
count    1094.000000
mean      161.797989
std       121.544145
min         1.000000
25%        70.000000
50%       135.000000
75%       228.750000
max       709.000000

In [51]:
df.describe()

       Boxes Shipped
count    1094.000000
mean      161.797989
std       121.544145
min         1.000000
25%        70.000000
50%       135.000000
75%       228.750000
max       709.000000